shubhamjoshi.shiv@gmail.com

In [22]:
import pandas as pd

In [23]:
df = pd.read_csv("chegg_purchase_data.csv")
df.head()

   invoice  time  price  num_items
0        1     2      3         34
1        4     5      6         34
2        7     8      9         34
3       10    11     12         23
4       13    14     15         23

In [24]:
df.loc[[0,4,6],['invoice','time','price']]

   invoice  time  price
0        1     2      3
4       13    14     15
6       16    17     44

In [25]:
num_rows=df.count()[0]

In [26]:
print(df.loc[(num_rows-1),:])

invoice      16
time         17
price        44
num_items    32
Name: 17, dtype: int64

In [27]:
df['price'].mean()

34.333333333333336

In [28]:
df["price"].max()

45

In [39]:
all_means = df.mean()
print(all_means)
avg_price = all_means['price']
print(avg_price)
avg_num_items = all_means['num_items']
print(avg_num_items)

invoice      13.277778
time         14.833333
price        34.333333
num_items    30.833333
dtype: float64
34.333333333333336
30.833333333333332

In [40]:
df["total"]=df["price"]*df['num_items']

In [41]:
print(df)

    invoice  time  price  num_items  total
0         1     2      3         34    102
1         4     5      6         34    204
2         7     8      9         34    306
3        10    11     12         23    276
4        13    14     15         23    345
5        12    23     45         23   1035
6        16    17     44         32   1408
7        16    17     44         32   1408
8        16    17     44         32   1408
9        16    17     44         32   1408
10       16    17     44         32   1408
11       16    17     44         32   1408
12       16    17     44         32   1408
13       16    17     44         32   1408
14       16    17     44         32   1408
15       16    17     44         32   1408
16       16    17     44         32   1408
17       16    17     44         32   1408

In [43]:
df['price'].nlargest(3).mean()

44.333333333333336

In [44]:
print(df.nunique())

invoice      7
time         7
price        7
num_items    3
total        7
dtype: int64

In [45]:
df.nunique()["time"]

7

In [59]:
df.describe()

         invoice       time      price  num_items        total
count  18.000000  18.000000  18.000000  18.000000    18.000000
mean   13.277778  14.833333  34.333333  30.833333  1064.666667
std     4.713005   5.124910  16.331132   3.682231   531.279145
min     1.000000   2.000000   3.000000  23.000000   102.000000
25%    12.250000  14.750000  22.250000  32.000000   517.500000
50%    16.000000  17.000000  44.000000  32.000000  1408.000000
75%    16.000000  17.000000  44.000000  32.000000  1408.000000
max    16.000000  23.000000  45.000000  34.000000  1408.000000

In [56]:
df.describe().loc["mean", "total"]-df.describe().loc["50%", "total"]

-343.33333333333326

In [57]:
df["total"].mean()-df["total"].median()

-343.33333333333326

In [63]:
print(df.drop(columns=["total"]))

    invoice  time  price  num_items
0         1     2      3         34
1         4     5      6         34
2         7     8      9         34
3        10    11     12         23
4        13    14     15         23
5        12    23     45         23
6        16    17     44         32
7        16    17     44         32
8        16    17     44         32
9        16    17     44         32
10       16    17     44         32
11       16    17     44         32
12       16    17     44         32
13       16    17     44         32
14       16    17     44         32
15       16    17     44         32
16       16    17     44         32
17       16    17     44         32